import colorama

colorama.init()

print(colorama.Fore.RED + 'Цей текст буде червоним' + colorama.Style.RESET_ALL)
print(colorama.Back.GREEN + 'Цей текст буде на зеленому фоні' + colorama.Style.RESET_ALL)
print(colorama.Style.BRIGHT + 'Цей текст буде яскравішим' + colorama.Style.RESET_ALL)

colorama.deinit()
#init(): метод, який ініціалізує бібліотеку і забезпечує взаємодію з консольним виведенням кольорів та форматуванням тексту.
#Його слід викликати перед використанням інших методів бібліотеки colorama.
#Fore: атрибут, який містить набір значень для зміни кольору переднього плану тексту. Наприклад, Fore.RED встановлює червоний колір тексту.
#Значення атрибута можна використовувати з іншими методами бібліотеки, наприклад, з init() або з методом print().
#Back: атрибут, який містить набір значень для зміни кольору заднього плану тексту. Наприклад, Back.GREEN встановлює зелений колір заднього плану.
#Значення атрибута можна використовувати з іншими методами бібліотеки, наприклад, з init() або з методом print().
#Style: атрибут, який містить набір значень для форматування тексту. Наприклад, Style.BRIGHT робить текст яскравішим.
#Значення атрибута можна використовувати з іншими методами бібліотеки, наприклад, з init() або з методом print().
#deinit(): метод, який відключає бібліотеку colorama і повертає консоль до початкового стану без форматування тексту.

